Revit 2027 API
ParameterTypeId.LockedBaseOffset Property
 "Negative Offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LockedBaseOffset { get; }
Public Shared ReadOnly Property LockedBaseOffset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LockedBaseOffset {
	ForgeTypeId^ get ();
}
static member LockedBaseOffset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace